Identifier: com.github.k3ll3r.munki.osquery-extension
ParentRecipe: com.github.k3ll3r.pkg.osquery-extension

Input:
  NAME: osquery-extension
  PKG_ID: 'com.company.osquery-extension'
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: |
      An osquery extension for macOS endpoint engineers
    developer: macadmins
    name: '%NAME%'
    display_name: '%NAME%'
    unattended_install: true
    postinstall_script: |
    #!/bin/bash
    
    echo "create /etc/osquery directory if needed"
    mkdir -p /etc/osquery
    
    echo "create extension load file"
    touch /etc/osquery/extensions.load
    
    echo "add osquery-extension path to load file"
    echo "/usr/local/lib/osquery/extensions/macadmins_extension.ext" > /etc/osquery/extensions.load

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
