Description: |
  Downloads the latest version of the Rectangle app.
Identifier: com.github.K3ll3r.download.Rectangle
MinimumVersion: 0.6.1

Input:
  NAME: Rectangle
  PRERELEASE: ''

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '[\S]+\.dmg'
    github_repo: rxhanson/Rectangle
    include_prereleases: '%PRERELEASE%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Rectangle.app'
    requirement: anchor apple generic and identifier "com.knollsoft.Rectangle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XSYZ3E4B7D)
