Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Duo Device Health and imports it into your JSS.
Identifier: com.github.K3ll3r.jss.DuoDeviceHealth
ParentRecipe: com.github.K3ll3r.pkg.DuoDeviceHealth
MinimumVersion: 1.0.0

Input:
  NAME: Duo Device Health
  CATEGORY: Utility
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  GROUP_NAME: '%NAME%-update-smart'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: "The Duo Device Health Application is an application installed on your desktop or laptop that performs health checks whenever you access Duo protected applications, ensuring that your computer meets the organization\u2019s security requirements. This helps protect corporate data and make sure your computer is less vulnerable to compromise."
  SELF_SERVICE_ICON: '%NAME%.png'
  version: '%version%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: 'Install Latest %NAME%'
    icon: '%SELF_SERVICE_ICON%'
    category: '%CATEGORY%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    policy_name: 'Install Latest %NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    VERSION: '%version%'
    replace_policy: true

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    replace_group: true
    computergroup_template: '%GROUP_TEMPLATE%'

