Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Duo Device Health.
Identifier: com.github.K3ll3r.download.DuoDeviceHealth
MinimumVersion: 1.0.0

Input:
  NAME: Duo Device Health

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://dl.duosecurity.com/DuoDeviceHealth-appcast-v2-macos-latest.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Install-DuoDeviceHealth.pkg'
    requirement: anchor apple generic and identifier "com.duosecurity.duo-device-health" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FNN8Z5JMFP)
