Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Duo Device Health and creates a package.
Identifier: com.github.K3ll3r.pkg.DuoDeviceHealth
ParentRecipe: com.github.K3ll3r.download.DuoDeviceHealth
MinimumVersion: 1.0.0

Input:
  NAME: Duo Device Health

Process:
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%/Install-DuoDeviceHealth.pkg'
