Description: Downloads the latest version of Slack and imports it into your JSS.
Identifier: com.github.K3ll3r.jamf.Slack
ParentRecipe: com.github.killahquam.pkg.slack
MinimumVersion: 1.0.0

Input:
  NAME: Slack
  CATEGORY: Productivity
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  GROUP_NAME: '%NAME%-update-smart'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: "Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go"
  SELF_SERVICE_ICON: '%NAME%.png'
  version: '%version%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: 'Install Latest %NAME%'
    icon: '%SELF_SERVICE_ICON%'
    category: '%CATEGORY%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    VERSION: '%version%'
    replace_policy: true

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    replace_group: true
    computergroup_template: '%GROUP_TEMPLATE%'

