Identifier: com.github.k3ll3r.munki.osquery
ParentRecipe: com.github.k3ll3r.download.osquery

Input:
  NAME: osquery
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: |
      osquery is an SQL powered operating system instrumentation, monitoring, and analytics platform.
      osquery exposes an operating system as a high-performance relational database.      
    developer: osquery
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
