Identifier: com.github.cruise-recipes.jamf.DEPNotify_provisioning-script
MinimumVersion: "2.3"

Input:
  Description: Provisioning Script for macOS using DEPNotify
  NAME: DEPNotify_provisioning
  SCRIPT_NAME: "DEPNotify_provisioning.sh"
  SCRIPT_PRIORITY: After
  POLICY_CATEGORY: "* Provisioning DEP Computers"
  SCRIPT_NOTES: "%Description%"


Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"