Description: Downloads the latest version of Wireshark and imports it into your JSS.
Identifier: com.github.K3ll3r.jamf.Wireshark
ParentRecipe: com.github.homebysix.pkg.Wireshark
MinimumVersion: 1.0.0

Input:
  NAME: Wireshark
  CATEGORY: Utility
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  GROUP_NAME: '%NAME%-update-smart'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: "Wireshark is a free and open-source packet analyzer. It is used for network troubleshooting, analysis, software and communications protocol development, and education."
  SELF_SERVICE_ICON: '%NAME%.png'
  version: '%version%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: 'Install Latest %NAME%'
    icon: '%SELF_SERVICE_ICON%'
    category: '%CATEGORY%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    VERSION: '%version%'
    replace_policy: true

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    replace_group: true
    computergroup_template: '%GROUP_TEMPLATE%'

