Identifier: com.github.k3ll3r.munki.gcloud
ParentRecipe: com.github.k3ll3r.pkg.gcloud

Input:
  NAME: gcloud
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: |
      The GCloud installer includes the gcloud, gsutil and bq command-line tools.
    developer: Google
    name: '%NAME%'
    display_name: '%NAME%'
    unattended_install: true
    postinstall_script: |
        #!/bin/bash
        loggedInUser=$( echo "show State:/Users/ConsoleUser" | scutil | awk '/Name :/ && ! /loginwindow/ { print $3 }' )

        echo "installing google cloud sdk and adding cli tools to path"
        /Users/$loggedInUser/google-cloud-sdk/install.sh --quiet --install-python false --path-update true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
